<template>
  <!-- 
    vue就地复用策略：
      vue会尽可能的就地(同层级,同位置)
      对比虚拟dom,就地复用旧dom结构,进行差异化更新

    虚拟dom：就是js对象,可以通过最少的属性结构描述出真实dom结构
       比如用 div = {
        type:'div',
        text:'111'
       }描述出 <div>111</div>
       页面dom结构是一个树形结构,html渲染出来的真实dom树,是个树形结构(复杂)。每个标签，都只是树的某个节点
       每个标签,虽然只是树形结构的一个小节点,属性也非常多=>遍历真实dom找差异,非常费时
       
    diff算法:
        就算是虚拟dom，和真实dom一样，也是树形结构
        策略1：
          先同层级根元素比较=>如果根元素变化,那么不考虑复用,整个dom树删除重建
          如果根元素不变,对比出属性的变化更新,并考虑往下递归复用
          对比同级兄弟元素时,默认按照下标进行对比复用,如果指定了key,就会按照相同key的元素来进行对比复用

    key的作用：提高虚拟dom的对比复用性能，key只能是字符串或数字，且唯一不重复     




  -->
  <div></div>
</template>

<script>
export default {
  data() {
    return {}
  },
  methods: {},
}
</script>

<style lang="less"></style>
